Revit 2027 API
ScheduleDefinition.RemoveEmbeddedSchedule Method
 Removes the embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveEmbeddedSchedule()
Public Sub RemoveEmbeddedSchedule
public:
void RemoveEmbeddedSchedule()
member RemoveEmbeddedSchedule : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This ScheduleDefinition does not have an embedded ScheduleDefinition.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace